"""
Объявите класс с именем RadiusVector для описания и работы с n-мерным вектором
(у которого n координат). Объекты этого класса должны создаваться командами:

# создание 5-мерного радиус-вектора с нулевыми значениями координат
(аргумент - целое число больше 1)
vector = RadiusVector(5)  # координаты: 0, 0, 0, 0, 0

# создание 4-мерного радиус-вектора с координатами: 1, -5, 3.4, 10
(координаты - любые целые или вещественные числа)
vector = RadiusVector(1, -5, 3.4, 10)
То есть, при передаче одного значения, оно интерпретируется, как размерность
нулевого радиус-вектора. Если же передается более одного числового аргумента,
то они интерпретируются, как координаты радиус-вектора.

Класс RadiusVector должен содержать методы:

set_coords(coord_1, coord_2, ..., coord_N) - для изменения координат
радиус-вектора;
get_coords() - для получения текущих координат радиус-вектора (в виде кортежа).

Также с объектами класса RadiusVector должны поддерживаться следующие функции:

len(vector) - возвращает число координат радиус-вектора (его размерность);
abs(vector) - возвращает длину радиус-вектора (вычисляется как:
sqrt(coord_1*coord_1 + coord_2*coord_2 + ... + coord_N*coord_N) -
корень квадратный из суммы квадратов координат).

Пример использования класса RadiusVector (эти строчки в программе писать
не нужно):

vector3D = RadiusVector(3)
vector3D.set_coords(3, -5.6, 8)
a, b, c = vector3D.get_coords()
vector3D.set_coords(3, -5.6, 8, 10, 11) # ошибки быть не должно, последние
две координаты игнорируются
vector3D.set_coords(1, 2) # ошибки быть не должно, меняются только первые
две координаты
res_len = len(vector3D) # res_len = 3
res_abs = abs(vector3D)
P.S. На экран ничего выводить не нужно, только объявить класс RadiusVector.
"""


class RadiusVector:
    """
    Класс для работы с n-мерным радиус-вектором.

    :ivar coords: Список координат радиус-вектора.
    """

    def __init__(self, *args: int | float) -> None:
        """
        Инициализация экземпляра класса RadiusVector.

        :param args: Если передан один аргумент (целое число > 1), создаётся
                    нулевой радиус-вектор соответствующей размерности. Если
                    передано несколько аргументов, они интерпретируются как
                    координаты радиус-вектора.
        :type args: int | float
        :raises ValueError: Если передан один аргумент, но он не является
                            целым числом > 1.
        :raises ValueError: Если переданы координаты, но они не являются
                            целыми или вещественными числами.
        """
        if len(args) == 1:
            if isinstance(args[0], int) and args[0] > 1:
                self.coords: list[int | float] = [0] * args[0]
            else:
                raise ValueError(
                    "Размерность должна быть целым числом больше 1.")
        else:
            if all(isinstance(x, (int, float)) for x in args):
                self.coords: list[int | float] = list(args)
            else:
                raise ValueError(
                    "Координаты должны быть целыми или вещественными числами.")

    def get_coords(self) -> tuple:
        """
        Возвращает текущие координаты радиус-вектора.

        :return: Кортеж координат.
        """
        return tuple(self.coords)

    def set_coords(self, *args: int | float) -> None:
        """
        Устанавливает новые координаты радиус-вектора.

        Если передано больше координат, чем размерность
        вектора, лишние игнорируются.
        Если передано меньше координат, чем размерность
        вектора, изменяются только первые координаты.

        :param args: Новые координаты.
        """
        for i in range(min(len(self.coords), len(args))):
            self.coords[i] = args[i]

    def __len__(self) -> int:
        """
        Возвращает размерность радиус-вектора.

        :return: Размерность радиус-вектора.
        """
        return len(self.coords)

    def __abs__(self) -> float:
        """
        Вычисляет длину радиус-вектора.

        :return: Длина радиус-вектора.
        """
        return (sum(i ** 2 for i in self.coords)) ** 0.5

